       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  VAR1  PIC 99.9.
       01  VAR2  PIC 99v9.
       01  FLAG  PIC X VALUE 'N'.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           ACCEPT VAR1.
           MOVE VAR1 TO VAR2.
           DISPLAY VAR2.

       END PROGRAM YOUR-PROGRAM-NAME.
